let array = [x, y];  //оголошення масиву
array[0] = 'fgd'//заміна н-го елементу масиву
arr[a, b, [c, f]]; arr[2][1] //иводить елемент з масиву в масиві
array.length //довжина масиву
let aray = [];
aray.push("watermelon") //додати додати елемент до масиву.
aray.unshift("fgh") //додати елемент до масиву з індексом 0
arr.shift() //видаляє елемент з масиву з індексом 0
arr.pop()  //видаляє останній елемент з масиву 
array.concat(aray, arr); //обєднує декілька масивів в один
array.indexOf('a') //показує позицію елементу в масиві, якщо немає -1
arr.join(separator) //виводить масив як стрінгу, замість сепаратора можна поставити знак розділення між елементами масиву
arr.pop() //видаляє останній елемент масиву